# Explain

The most important and frequently used of the joins is the **INNER JOIN**. They are also referred to as an **EQUIJOIN**.

The **INNER JOIN** creates a new result table by combining column values of two tables (table1 and table2) based upon the join-predicate. The query compares each row of table1 with each row of table2 to find all pairs of rows which satisfy the join-predicate. When the join-predicate is satisfied, column values for each matched pair of rows of A and B are combined into a result row.

**Syntax**

The basic syntax of the **INNER JOIN** is as follows.

```sql
SELECT table1.column1, table2.column2...
FROM table1
INNER JOIN table2
ON table1.common_field = table2.common_field;
```

![](../images/inner-join-trong-sql.png)

# Example

## create db

In [13]:
%%bash
../scripts/create_db_server.sh

my-postgresql
fd093f4fbb8efd2ff162a64c3b7a88cf64153c501a31c237d9db364d985f45d1

Connection to localhost 5432 port [tcp/postgresql] succeeded!

Created db server

## load sql extension and connect db

In [14]:
%load_ext sql
%sql postgresql://postgres:password123@localhost/dvdrental

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## create CUSTOMERS table

In [15]:
%%sql

CREATE TABLE IF NOT EXISTS CUSTOMERS (
   ID   INT              NOT NULL,
   NAME VARCHAR (20)     NOT NULL,
   AGE  INT              NOT NULL,
   ADDRESS  CHAR (25),
   SALARY   DECIMAL (18, 2),
   PRIMARY KEY (ID)
);

INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (1, 'Ha Anh', 32, 'Da Nang', 2000.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (2, 'Van Ha', 25, 'Ha Noi', 1500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (3, 'Vu Bang', 23, 'Vinh', 2000.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (4, 'Thu Minh', 25, 'Ha Noi', 6500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (5, 'Hai An', 27, 'Ha Noi', 8500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (6, 'Hoang', 22, 'Ha Noi', 4500.00 ) ON CONFLICT DO NOTHING;
INSERT INTO CUSTOMERS (ID,NAME,AGE,ADDRESS,SALARY)
    VALUES (7, 'Binh', 24, 'Ha Noi', 10000.00 ) ON CONFLICT DO NOTHING;

SELECT * FROM CUSTOMERS;

 * postgresql://postgres:***@localhost/dvdrental
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
7 rows affected.

[(1, 'Ha Anh', 32, 'Da Nang                  ', Decimal('2000.00')),
 (2, 'Van Ha', 25, 'Ha Noi                   ', Decimal('1500.00')),
 (3, 'Vu Bang', 23, 'Vinh                     ', Decimal('2000.00')),
 (4, 'Thu Minh', 25, 'Ha Noi                   ', Decimal('6500.00')),
 (5, 'Hai An', 27, 'Ha Noi                   ', Decimal('8500.00')),
 (6, 'Hoang', 22, 'Ha Noi                   ', Decimal('4500.00')),
 (7, 'Binh', 24, 'Ha Noi                   ', Decimal('10000.00'))]

## create ORDERS table

In [16]:
%%sql

CREATE TABLE IF NOT EXISTS ORDERS (
   OID  INT              NOT NULL,
   DATE VARCHAR (20)     NOT NULL,
   CUSTOMER_ID INT       NOT NULL,
   AMOUNT INT,
   PRIMARY KEY (OID)
);

INSERT INTO ORDERS (OID, DATE, CUSTOMER_ID, AMOUNT)
    VALUES (102, '2009-10-08 00:00:00', 3, 10) ON CONFLICT DO NOTHING;
INSERT INTO ORDERS (OID, DATE, CUSTOMER_ID, AMOUNT)
    VALUES (100, '2009-10-08 00:00:00', 3, 15) ON CONFLICT DO NOTHING;
INSERT INTO ORDERS (OID, DATE, CUSTOMER_ID, AMOUNT)
    VALUES (101, '2009-11-20 00:00:00', 2, 5) ON CONFLICT DO NOTHING;
INSERT INTO ORDERS (OID, DATE, CUSTOMER_ID, AMOUNT)
    VALUES (103, '2008-05-20 00:00:00', 4, 20) ON CONFLICT DO NOTHING;

SELECT CUSTOMER_ID, AMOUNT, DATE
FROM ORDERS
ORDER BY CUSTOMER_ID;

 * postgresql://postgres:***@localhost/dvdrental
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
4 rows affected.

[(2, 5, '2009-11-20 00:00:00'),
 (3, 10, '2009-10-08 00:00:00'),
 (3, 15, '2009-10-08 00:00:00'),
 (4, 20, '2008-05-20 00:00:00')]

## do INNER JOIN

In [20]:
%%sql

SELECT  c.ID, c.NAME, o.AMOUNT, o.DATE
    FROM CUSTOMERS c
    INNER JOIN ORDERS o
    ON c.ID = o.CUSTOMER_ID

-- SELECT  ID, AMOUNT, DATE, NAME
--    FROM CUSTOMERS
--    INNER JOIN ORDERS
--    ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID
--    ORDER BY ID

 * postgresql://postgres:***@localhost/dvdrental
4 rows affected.

[(2, 5, '2009-11-20 00:00:00', 'Van Ha'),
 (3, 10, '2009-10-08 00:00:00', 'Vu Bang'),
 (3, 15, '2009-10-08 00:00:00', 'Vu Bang'),
 (4, 20, '2008-05-20 00:00:00', 'Thu Minh')]